{"class_name": "Model", "config": {"name": "model_4", "layers": [{"name": "time_distributed_127_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 15, 3], "dtype": "float32", "sparse": false, "name": "time_distributed_127_input"}, "inbound_nodes": []}, {"name": "time_distributed_136_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 15, 3], "dtype": "float32", "sparse": false, "name": "time_distributed_136_input"}, "inbound_nodes": []}, {"name": "time_distributed_127", "class_name": "TimeDistributed", "config": {"name": "time_distributed_127", "trainable": true, "batch_input_shape": [null, 32, 32, 15, 3], "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_29", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_127_input", 0, 0, {}]]]}, {"name": "time_distributed_136", "class_name": "TimeDistributed", "config": {"name": "time_distributed_136", "trainable": true, "batch_input_shape": [null, 32, 32, 15, 3], "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_31", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_136_input", 0, 0, {}]]]}, {"name": "time_distributed_128", "class_name": "TimeDistributed", "config": {"name": "time_distributed_128", "trainable": true, "dtype": "float32", "layer": {"class_name": "Activation", "config": {"name": "activation_29", "trainable": true, "dtype": "float32", "activation": "relu"}}}, "inbound_nodes": [[["time_distributed_127", 0, 0, {}]]]}, {"name": "time_distributed_137", "class_name": "TimeDistributed", "config": {"name": "time_distributed_137", "trainable": true, "dtype": "float32", "layer": {"class_name": "Activation", "config": {"name": "activation_31", "trainable": true, "dtype": "float32", "activation": "relu"}}}, "inbound_nodes": [[["time_distributed_136", 0, 0, {}]]]}, {"name": "time_distributed_129", "class_name": "TimeDistributed", "config": {"name": "time_distributed_129", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_30", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_128", 0, 0, {}]]]}, {"name": "time_distributed_138", "class_name": "TimeDistributed", "config": {"name": "time_distributed_138", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_32", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_137", 0, 0, {}]]]}, {"name": "time_distributed_130", "class_name": "TimeDistributed", "config": {"name": "time_distributed_130", "trainable": true, "dtype": "float32", "layer": {"class_name": "Activation", "config": {"name": "activation_30", "trainable": true, "dtype": "float32", "activation": "relu"}}}, "inbound_nodes": [[["time_distributed_129", 0, 0, {}]]]}, {"name": "time_distributed_139", "class_name": "TimeDistributed", "config": {"name": "time_distributed_139", "trainable": true, "dtype": "float32", "layer": {"class_name": "Activation", "config": {"name": "activation_32", "trainable": true, "dtype": "float32", "activation": "relu"}}}, "inbound_nodes": [[["time_distributed_138", 0, 0, {}]]]}, {"name": "time_distributed_131", "class_name": "TimeDistributed", "config": {"name": "time_distributed_131", "trainable": true, "dtype": "float32", "layer": {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_15", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}}, "inbound_nodes": [[["time_distributed_130", 0, 0, {}]]]}, {"name": "time_distributed_140", "class_name": "TimeDistributed", "config": {"name": "time_distributed_140", "trainable": true, "dtype": "float32", "layer": {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_16", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}}, "inbound_nodes": [[["time_distributed_139", 0, 0, {}]]]}, {"name": "time_distributed_132", "class_name": "TimeDistributed", "config": {"name": "time_distributed_132", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dropout", "config": {"name": "dropout_15", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}}}, "inbound_nodes": [[["time_distributed_131", 0, 0, {}]]]}, {"name": "time_distributed_141", "class_name": "TimeDistributed", "config": {"name": "time_distributed_141", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dropout", "config": {"name": "dropout_16", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}}}, "inbound_nodes": [[["time_distributed_140", 0, 0, {}]]]}, {"name": "time_distributed_133", "class_name": "TimeDistributed", "config": {"name": "time_distributed_133", "trainable": true, "dtype": "float32", "layer": {"class_name": "Flatten", "config": {"name": "flatten_15", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}}, "inbound_nodes": [[["time_distributed_132", 0, 0, {}]]]}, {"name": "time_distributed_142", "class_name": "TimeDistributed", "config": {"name": "time_distributed_142", "trainable": true, "dtype": "float32", "layer": {"class_name": "Flatten", "config": {"name": "flatten_16", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}}, "inbound_nodes": [[["time_distributed_141", 0, 0, {}]]]}, {"name": "time_distributed_134", "class_name": "TimeDistributed", "config": {"name": "time_distributed_134", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_35", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_133", 0, 0, {}]]]}, {"name": "time_distributed_143", "class_name": "TimeDistributed", "config": {"name": "time_distributed_143", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_37", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_142", 0, 0, {}]]]}, {"name": "time_distributed_135", "class_name": "TimeDistributed", "config": {"name": "time_distributed_135", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "first_dense_rgb", "trainable": true, "dtype": "float32", "units": 35, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_134", 0, 0, {}]]]}, {"name": "time_distributed_144", "class_name": "TimeDistributed", "config": {"name": "time_distributed_144", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "first_dense_flow", "trainable": true, "dtype": "float32", "units": 35, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_143", 0, 0, {}]]]}, {"name": "lstm_layer_rgb", "class_name": "LSTM", "config": {"name": "lstm_layer_rgb", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 20, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "inbound_nodes": [[["time_distributed_135", 0, 0, {}]]]}, {"name": "lstm_layer_flow", "class_name": "LSTM", "config": {"name": "lstm_layer_flow", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 20, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "inbound_nodes": [[["time_distributed_144", 0, 0, {}]]]}, {"name": "time_distr_dense_one_rgb", "class_name": "TimeDistributed", "config": {"name": "time_distr_dense_one_rgb", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_36", "trainable": true, "dtype": "float32", "units": 5, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["lstm_layer_rgb", 0, 0, {}]]]}, {"name": "time_distr_dense_one_flow", "class_name": "TimeDistributed", "config": {"name": "time_distr_dense_one_flow", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_38", "trainable": true, "dtype": "float32", "units": 5, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["lstm_layer_flow", 0, 0, {}]]]}, {"name": "global_avg_rgb", "class_name": "GlobalAveragePooling1D", "config": {"name": "global_avg_rgb", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["time_distr_dense_one_rgb", 0, 0, {}]]]}, {"name": "global_avg_flow", "class_name": "GlobalAveragePooling1D", "config": {"name": "global_avg_flow", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["time_distr_dense_one_flow", 0, 0, {}]]]}, {"name": "concatenate_7", "class_name": "Concatenate", "config": {"name": "concatenate_7", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["global_avg_rgb", 0, 0, {}], ["global_avg_flow", 0, 0, {}]]]}, {"name": "dense_39", "class_name": "Dense", "config": {"name": "dense_39", "trainable": true, "dtype": "float32", "units": 5, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_7", 0, 0, {}]]]}], "input_layers": [["time_distributed_127_input", 0, 0], ["time_distributed_136_input", 0, 0]], "output_layers": [["dense_39", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}